### Inner Joins

In [1]:
import pandas as pd

In [2]:
week1 = pd.read_csv('Restaurant - Week 1 Sales.csv')
week2 = pd.read_csv('Restaurant - Week 2 Sales.csv')
customers = pd.read_csv('Restaurant - Customers.csv')
foods = pd.read_csv('Restaurant - Foods.csv')

In [28]:
# pd.merge(left = week1, right = week2, how = 'inner', on = 'Customer ID')
week1.merge(right = week2, how = 'inner', on = 'Customer ID', suffixes = [' - Week1', ' - Week2'] )

    Customer ID  Food ID - Week1  Food ID - Week2
0           537                9                5
1           155                9                3
2           155                1                3
3           503                5                8
4           503                5                9
..          ...              ...              ...
57          945                5                4
58          343                3                5
59          343                3                2
60          343                3                7
61          621                9                6

[62 rows x 3 columns]

### Inner Joins using Multiple Columns

In [16]:
week1.head()

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1
3          202        2
4          155        9

In [17]:
week2.head()

   Customer ID  Food ID
0          688       10
1          813        7
2          495       10
3          189        5
4          267        3

In [19]:
"""Customers who came on both weeks and ordered the exact same food"""
pd.merge(left = week1, right = week2, how = 'inner', on = ['Customer ID', 'Food ID'] )

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [21]:
week1[(week1['Customer ID'] == 21) & (week1['Food ID'] == 4)]

     Customer ID  Food ID
101           21        4
212           21        4

In [22]:
week2[(week2['Customer ID'] == 21) & (week2['Food ID'] == 4)]

    Customer ID  Food ID
30           21        4

### Outer Joins

In [31]:
"""
No Null Values => Customer ID found in both the DataFrames
Null Values in Week2 Column => Customer ID found only in Week1 DataFrame
Null Values in Week1 Column => Customer ID found only in Week2 DataFrame
"""

merged_data = pd.merge(left = week1, 
                         right = week2, 
                         how = 'outer', 
                         on = 'Customer ID', 
                         suffixes = [' - Week1', ' - Week2'], 
                         indicator = True )

In [34]:
merged_data['_merge'].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [38]:
merged_data[(merged_data['_merge'] == 'right_only') | (merged_data['_merge'] == 'left_only')]

merged_data[merged_data['_merge'].isin(['left_only', 'right_only'])]

     Customer ID  Food ID - Week1  Food ID - Week2      _merge
1             97              4.0              NaN   left_only
2            658              1.0              NaN   left_only
3            202              2.0              NaN   left_only
6            213              8.0              NaN   left_only
7            600              1.0              NaN   left_only
..           ...              ...              ...         ...
449          855              NaN              4.0  right_only
450          559              NaN             10.0  right_only
451          276              NaN              4.0  right_only
452          556              NaN             10.0  right_only
453          252              NaN              9.0  right_only

[392 rows x 4 columns]